app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_date" ASC
---
  def index
    @tasks = Task.all.order(:completion_date)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    id = params[:id].to_i
    @task = Task.find_by(id: id)

INSERT INTO "tasks" ("name", "description", "completion_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Dance Dance"], ["description", "Wiggle that bum"], ["completion_time", "08:00:00"], ["created_at", "2018-09-19 22:46:00.428641"], ["updated_at", "2018-09-19 22:46:00.428641"]]
---
  def create
    @task = Task.new(book_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @task = Task.find(params[:id].to_i)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "Dance Dance!!!"], ["updated_at", "2018-09-19 23:07:36.418544"], ["id", 3]]
---
    task = Task.find(params[:id].to_i)
    task.update(book_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 4]]
---
    task = Task.find(params[:id].to_i)
    @deleted_task = task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "tasks" SET "complete" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["complete", true], ["completion_date", "2018-09-21 22:20:30.555149"], ["updated_at", "2018-09-21 22:20:30.556544"], ["id", 11]]
---
  def strikethrough
    @task = Task.find(params[:id].to_i)
    if @task.complete == false
      @task.complete = true
      @task.completion_date = DateTime.now
    elsif @task.complete == true
      @task.complete = false
      @task.completion_date = nil
    end
    @task.save