app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_time" ASC
---
  def index
    @tasks = Task.all.order(:completion_time)

SELECT  "tasks".* FROM "tasks" WHERE (2) LIMIT $1  [["LIMIT", 1]]
---
  def show
    @task = Task.find(params[:id].to_i)

INSERT INTO "tasks" ("name", "description", "completion_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Dance Dance"], ["description", "Wiggle that bum!"], ["completion_time", "08:00:00"], ["created_at", "2018-09-19 23:00:29.772291"], ["updated_at", "2018-09-19 23:00:29.772291"]]
---
  def create
    @task = Task.new(name: params[:task][:name], description: params[:task][:description], completion_time: params[:task][:completion_time])
    if @task.save